# ArePointsEditable Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TopographySurface..::..ArePointsEditable Property
TopographySurface Class See Also
---
Identifies whether the points of this topography surface can be edited independently. Topography surfaces created from external data will not allow editing of individual points.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public bool ArePointsEditable { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ArePointsEditable As Boolean
	Get
```

Visual C++
---
```text
public:
property bool ArePointsEditable {
	bool get ();
}
```

# See Also
TopographySurface Class
Autodesk.Revit.DB.Architecture Namespace